tutorials/atmTurbPimpleFoam/atmBoundary/constant/atmTurbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
g							[0 1 -2 0 0] (0 0 -10);
f							[0 0 -1 0 0] (0 0 1e-4);
Ug						[0 1 -1 0 0] (10 0 0);
theta0				[0 0 0 1 0] 300;
rho0					[1 -3 0 0 0] 1;
p0						[1 -1 -2 0 0] 1e5;
