tutorials/atmTurbPimpleFoam/atmBoundary/0/q
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      q;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    floor
    {
        type            fixedGradient;
        gradient        uniform 0;
    }

    ceiling
    {
        type            zeroGradient;
        value           uniform 0;
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    leftBoundary
    {
        type            cyclic;
    }

    rightBoundary
    {
        type            cyclic;
    }
}

// ************************************************************************* //
